[{"title":"Command Line","link":"terminal","tagline":"Complete complex tasks with just a few keystrokes.","icon":"fa-terminal","repo":"","etherpad":"https://public.etherpad-mozilla.org/p/swc-dig-res-bootcamp","more_info_link":"http://swcarpentry.github.io/shell-novice/","session":"1","description":"Introduction to the UNIX command line. Topics covered will include navigating the filesystem, manipulating the environment, executing useful commands, and using pipes to communicate between programs. This session will teach you how to communicate directly with your computer’s operating system using a text-based interface and is a useful first step in learning many other technical skills. For more information, visit: http://swcarpentry.github.io/shell-novice/","sort":"a","day":"Day 1"},{"title":"Git","link":"git","tagline":"Simplify collaboration using version control systems.","icon":"fa-code-fork","repo":"","etherpad":"https://public.etherpad-mozilla.org/p/swc-dig-res-bootcamp","more_info_link":"http://swcarpentry.github.io/git-novice/","session":"3","description":"Git is a tool for managing changes to a set of files. It allows users to access open source repositories, recover earlier versions of a project, and collaborate with other contributors. This session will be beneficial to anyone working with data, code, or text. For more information, visit: http://swcarpentry.github.io/git-novice/","sort":"b","day":"Day 2"},{"title":"Python","link":"python","tagline":"Use Python for everything from data analysis to building websites.","icon":"icon-python","repo":"https://app.mybinder.org:80/3446279863/tree","etherpad":"https://public.etherpad-mozilla.org/p/swc-dig-res-bootcamp","more_info_link":"http://swcarpentry.github.io/python-novice-inflammation/","session":"5","description":"Python is a programming language that can be used for a wide range of tasks, including collecting and analyzing data and building web applications. It is likely the most popular language for academic researchers. This session will be useful for anyone who wants to take a programmatic approach to research. For more information visit: http://swcarpentry.github.io/python-novice-inflammation/\n","sort":"c","day":"Day 1"},{"title":"Data Cleaning","link":"data","tagline":"Build a robust dataset using data cleaning best practices.","icon":"fa-table","repo":"","etherpad":"https://public.etherpad-mozilla.org/p/gcdrb_data_cleaning","more_info_link":"","session":"9","description":"Working with real-world data is often messy and complicated. This session is an overview of some common problems that arise when working with datasets, including converting between file types, resolving inconsistent metadata, and working with APIs.\n","sort":"d","day":"Day 3"},{"title":"Data Formats","link":"databases","tagline":"Apply data best practices to complex data. ","icon":"fa-database","repo":"","etherpad":"","more_info_link":"","session":"10","description":"This session will go more in-depth into the different types of data researchers work with and the challenges that commonly arise when trying to clean data and prepare it for analysis. This session will be beneficial to anyone who needs to convert between data types, has large amounts of data to work with, or may encounter missing or messy data.","sort":"e","day":"Day 3"},{"title":"Twitter API","link":"twitter","tagline":"Efficiently sift through enourmous amounts of twitter data using an API. . ","icon":"fa-twitter","repo":"https://github.com/smythp/twitter-workshop","etherpad":"","more_info_link":"","session":"10","description":"This session will cover the basics of accessing data via the Twitter API. including specific challenges that arise when working with large, text-based data sets. This session will be beneficial for anyone who wants to collect data from Twitter or other social networks. ","sort":"f","day":"Day 3"},{"title":"Scientific Python","link":"scipy","tagline":"Summarize and analyze  data using scientific computing libraries.","icon":"fa-flask","repo":"","etherpad":"https://public.etherpad-mozilla.org/p/gcdrb_scipy","more_info_link":"","session":"11","description":"This session will discuss how to work with N-dimensional array data using numpy and scipy. It will discuss tools for efficiently filtering data, methods for statistically analysing data, linear algebra routines, and various signal processing routines. This session will also discuss how to use masked arrays to work with missing values. This session is aimed towards researchers working with N-dimensional quantitative data. ","sort":"g","day":"Day 3"},{"title":"HTML, CSS, and Javascript","link":"html","tagline":"Share your research using web development fundamentals.","icon":"fa-code","repo":"","etherpad":"","more_info_link":"","session":"14","description":"Modern web pages are created using HTML to control content, CSS to control appearance, and JavaScript to dictate behavior. This session will be helpful for anyone that wants to build on the web.","sort":"h","day":"Day 4"},{"title":"Data Visualization","link":"viza","tagline":"Generate visualizations to uncover the story the data is telling.","icon":"fa-area-chart","repo":"","etherpad":"","more_info_link":"","session":"15","description":"Communicating your findings can be just as important as getting those findings in the first place. This session will introduce ways to visually represent complex data (text-based, numerical, and temporal) in order to reach a wider audience. ","sort":"i","day":"Day 4"},{"title":"Text Analysis with NLTK","link":"nltk","tagline":"Process, analyze, and summarize textual data using NLTK","icon":"fa-book","repo":"http://michellejm.github.io/GCDRB_Text_Analysis/","etherpad":"","more_info_link":"","session":"11","description":"The Natural Language Toolkit (NLTK) is a Python library that allows researchers to work with text-based data, such as literary works or social media corpora. Through attending this session, you will learn how to use Python to analyze large amounts of text to find word frequencies, collocations, and other patterns invisible from a non-computational perspective. This session will be of particular use to researchers who work with any form of text-based data.","sort":"k","day":"Day 3"},{"title":"Digital Identity with Wordpress","link":"identity","tagline":"Gain some control over how people encounter research on the web.","icon":"fa-users","repo":"","etherpad":"","more_info_link":"","session":"13","description":"This session will discuss the basics of building a digital academic identity in online spaces to effectively showcase your research and network with scholars in your field. We will use the CUNY Academic Commons to explore personal website creation using the WordPress platform, and will review best practices for organization and design, theme editing, content management, blogging, and image use. Participants who have ideas for project-based or personal websites are welcome to begin implementing these in this session. ","sort":"l","day":"Day 4"},{"title":"GIS","link":"gis","tagline":"Analyze spatial information and out data on the map. ","icon":"fa-globe","repo":"","etherpad":"","more_info_link":"","session":"13","description":"These sessions will explore the basics of mapping and geospatial representation of data and applythat knowledge to make maps, visualize spatial relationships and analyze spatial data on CartoDB. This session will be useful for anyone whose data has a spatial component or who wants to incorporate spatial relationships into their analysis.","sort":"j","day":"Day 4"},{"title":"Machine Learning","link":"ml","tagline":"Explore the structure of data using machine learning algorithms.","icon":"fa-magic","repo":"","etherpad":"","more_info_link":"","session":"12","description":"This session will introduce regression analysis, data preprocessing, model selection, supervised and unsupervised machine learning and dimension reduction using the sklearn machine learning library. This session is aimed towards researchers who want to find patterns in their data or use their data to predict a phenomena. ","sort":"m","day":"Day 3"}]