{"lr":{"shortname":"lr","name":"Lisa Rhody","title":"Deputy Director of Digital Initiatives","email":"lisarhody.gc@gmail.com","website":"","twitter":"@lmrhody","github":"https://github.com/lmrhody","bio":"<p>Dr. Lisa Rhody is the Deputy Director of Digital Initiatives at the Graduate Center at CUNY. Before joining the Graduate Center, Lisa was associate director of research and research assistant professor at the Roy Rosenzweig Center for History and New Media (RRCHNM) at George Mason University, where she oversaw technical development of PressForward and Zotero. She was also editor of the Journal of Digital Humanities and Digital Humanities Now. She earned her Ph.D. in English Language and Literature from the University of Maryland. Her research combines advanced computational methods such as topic modeling and social network analysis with more traditional literary analysis to study 20th and 21st-century American literature, particularly ekphrastic poetry (poems that take the visual arts as their subject) by contemporary women poets. More broadly, she is interested in the 20th and 21st century American literature, verbal-visual studies, scholarly communication, and digital humanities.</p>","image":""},"sz":{"shortname":"sz","name":"Stephen Zweibel","title":"Digital Scholarship Librarian","email":"","website":"","twitter":"@SteveZweibel","github":"https://github.com/szweibel","bio":"<p>Stephen Zweibel is the Data and Digital Projects Librarian at CUNY Graduate Center and the lead developer of the NEH-funded DH Box, a digital humanities laboratory in the cloud. As a library systems specialist, Stephen focuses on emerging technologies for reference and data management, with a particular focus on APIs, web apps, and flexible distributions. His previous projects include Augur, a web app that tracks statistics about library reference desk interactions, and Know Thy Shelf, a radio frequency identification (RFID)-based inventory management system for libraries.</p>","image":""},"sm":{"shortname":"sm","name":"Stefano Morello","title":"Digital Fellow, English","email":"veritas44@gmail.com","website":"","twitter":"@steomor","github":"https://github.com/smorello87","bio":"<p>Stefano Morello is a fourth-year doctoral candidate in English. His academic interests include American Studies, pop culture, poetics, and archive theory. His dissertation explores the heterotopic space of the East-Bay punk scene, its modes of resistance and (dis-)association, and the clashes between its politics and aesthetics. He serves as co-chair of the Graduate Forum of the Italian Association for American Studies (AISNA) and is a founding editor of its journal, JAm It! (Journal of American Studies in Italy).</p>","image":""},"kc":{"shortname":"kc","name":"Kelsey Chatlosh","title":"Digital Fellow, Anthropology","email":"kelseychatlosh@gmail.com","website":"","twitter":"@kchatlosh","github":"https://github.com/kchatlosh","bio":"","image":""},"jk":{"shortname":"jk","name":"Jojo Karlin","title":"Digital Fellow, English","email":"jojo.karlin@gmail.com","website":"","twitter":"@jojokarlin","github":"https://github.com/jojokarlin","bio":"<p>As a digital humanist, Stefano focuses on archival practices, with a knack for archival pedagogy and public facing initiatives. He is currently creating an open access archive of East Bay zines and co-curating an exhibition based on his yet unpublished M.A. dissertation on a neighborhood on the Lower East Side subject to a process of slum-making during the Progressive Era.</p>","image":""},"jo":{"shortname":"jo","name":"Javier Otero Peña","title":"Digital Fellow, Environmental Psychology","email":"","website":"","twitter":"@javo01","github":"https://github.com/javo0101","bio":"<p>Javier Otero Peña is a Venezuelan 2nd year student in Environmental Psychology. He is currently involved in a research project to study the politization of a public space in East Harlem through participatory art on a wall. He is also interested in exploring how the presence of public spaces in social media can transform the perception of these spaces and even become part of their identity; in other words, how the virtual space becomes an extension of the physical space. Javier holds a Master in Environmental Policies and Sustainable Development, and taught a class on Sustainable Development in Latin America and the Caribbean at the Paris Catholic University. He also worked as a consultant for the United Nations Environment Programme for three years.</p>","image":""},"rr":{"shortname":"rr","name":"Rachel Rakov","title":"Digital Fellow, Linguistics","email":"","website":"","twitter":"@ssdd3","github":"https://github.com/ssdd3","bio":"<p>Rachel Rakov is a doctoral student in the Linguistics Department, with a focus in Computational Linguistics. Her research is on improving speech prosody modeling techniques for a variety of tasks that fall within automatic speech recognition. Her current research is using prosody modeling to train computational models that can distinguishing between native and non-native speech. She has also worked on building tools for automatic language identification, and tools for automatic detection of sarcastic speech. She has presented her research at Interspeech as well as at Python conferences. Rachel has helped develop and teach courses in Python programming and Natural Language Processing for the Computational Linguistics MA program at The Graduate Center. She was also a consultant on O&#39;Reilly book “Introduction to Machine Learning”, where she provided input on how to make the content of the book more accessible to readers without a math or CS background. Rachel has been an intern with the Speech-Language Technology team at Interactions, works in the Speech Lab at Queens College, and teaches at Hunter College.</p>","image":""},"psw":{"shortname":"psw","name":"Patrick Sweeney","title":"Digital Fellow, Psychology","email":"psweeney@gradcenter.cuny.edu","website":"","twitter":"@pswee","github":"https://github.com/pswee001","bio":"<p>Patrick Sweeney is a doctoral candidate in Psychology at the Graduate Center, City University of New York (CUNY); and a Digital Fellow at the Graduate Center Digital Scholarship Lab. As a part of his role as a Digital Fellow, he is a faculty liaison to the New Media Lab. He also is a graduate student representative to the Executive Committee of the Society for Qualitative Inquiry in Psychology. His dissertation explores the complementary application of computer assisted text analysis and discourse analysis to study how scientific theories about the etiology of homosexuality have become part of public discourse and used in arguments to expand or contract the scope of justice. His research interests include moral inclusion, citizenship, queer theory, qualitative methods, digital media, and critical psychology. Prior to becoming a Digital Fellow, Patrick taught psychology at Hunter College, CUNY; and was a Writing Across the Curriculum Fellow at Kingsborough Community College, CUNY.</p>","image":""},"kh":{"shortname":"kh","name":"Kristen Hackett","title":"Digital Fellow, Psychology","email":"hackettka@gmail.com","website":"","twitter":"@ka_hackett","github":"https://github.com/hackettka","bio":"<p>Kristen Hackett is a scholar, activist and educator living and working in New York City. She is a PhD Candidate in Environmental Psychology Program at the Graduate Center of the City of New York, a Digital Fellow with the GC Digital Scholarship Lab, a Digital Pedagogy Fellow with the OpenLab at City Tech, a Coordinator of OpenCUNY, and a member of the Executive Committee of the Justice For All Coalition. Her research interests are in housing and community development in NYC, political and social responses to increasing insecurity and precarity and how art and technology can be used in consciousness-raising and resistance efforts and to advocate for community/human-centered policy development. For her dissertation, Kristen is exploring these themes through the lens a proposed rezoning in Long Island City, NY. </p>","image":""},"ha":{"shortname":"ha","name":"Hannah Aizenman","title":"Digital Fellow, Computer Science","email":"haizenman@gradcenter.cuny.edu","website":"","twitter":"@story645","github":"https://github.com/story645","bio":"<p>Hannah Aizenman is a doctoral student  in Computer Science. Her research is in using machine learning to make sense of and visualize large, mostly climate, datasets. She was an adjunct at CCNY for the past 5 years and has taught and mentored high school students for the CREST HIRES REU program for the past 3 summers. Most recently, she&#39;s been a contributor to the open source matplotlib (Python&#39;s main visualization library) project; specifically she&#39;s been adding better support for visualizing categorical data.</p>","image":""},"psm":{"shortname":"psm","name":"Patrick Smyth","title":"Digital Fellow, English","email":"psmyth@gradcenter.cuny.edu","website":"","twitter":"@psmyth01","github":"https://github.com/smythp","bio":"<p>Patrick Smyth is a Ph.D. student in English and MA Advising Fellow at The Graduate Center, CUNY. He is a developer for DH Box, an NEH-funded project to make the digital humanities more widely accessible, and recently led curriculum design for the Digital Research Institute, a week-long intensive course in digital methods at the Graduate Center. Patrick works at the intersection of the digital humanities, disability studies, and the public humanities. Two of his recent projects include the NEH Impact Index and Eloud, a screen reader written in the Lisp programming language. His thesis project is Negotiated Access, an argument on the need for citizen technology to express and preserve community values. Patrick is a former Fulbright Fellow, and has taught at Queens College. First name:  Last name:  Say hi!</p>","image":""}}