{"ha":{"shortname":"ha","name":"Hannah Aizenman","title":"Digital Fellow, Computer Science","email":"haizenman@gradcenter.cuny.edu","website":"","twitter":"@story645","github":"https://github.com/story645","bio":"<p>Hannah Aizenman is a doctoral student  in Computer Science. Her research is in using machine learning to make sense of and visualize large, mostly climate, datasets. She was an adjunct at CCNY for the past 5 years, mostly teaching engineers how to program. For the past 3 years, she has taught and mentored high school students for the CREST HIRES REU program. She’s spoken at a couple of Python conferences, is on the planning committee of the AMS Python Symposium, and is an organizer for the New York Linux Users Group (NYLUG).</p>","image":""},"psm":{"shortname":"psm","name":"Patrick Smyth","title":"Digital Fellow, English","email":"psmyth@gradcenter.cuny.edu","website":"","twitter":"@psmyth01","github":"","bio":"<p>Patrick Smyth is a fourth-year doctoral student in English. His research focuses on Utopian thought and the history of science in 18th and 19th century British literature. As a digital humanist, Patrick is concerned with digital platforms for research and pedagogy. He is currently a developer on the NEH-funded DH Box, a cloud-based platform for accessing digital humanities tools, and has received a Provost&#39;s Digital Innovation grant for an online archive of science fiction works. His most recent publication is “Ebooks and the Digital Paratext: Emerging Trends in the Interpretation of Digital Media” in Examining Paratextual Theory and Its Applications in Digital Culture. Patrick was a 2010 Fulbright Teaching Fellow in Berlin, Germany, and teaches composition and literature at Queens College.</p>","image":""},"mm":{"shortname":"mm","name":"Michelle McSweeney (Johnson)","title":"Digital Fellow, Linguistics","email":"","website":"","twitter":"@MMcSweeney7","github":"","bio":"<p>Michelle McSweeney is a recent graduate of the PhD program in Linguistics and was a Digital Fellow from 2014-2016. Her research is on the texting patterns of bilingual adolescents, and what that can reveal about digital communication as its own language variety, and she is currently developing her dissertation into a book about how intimacy is established through text message. With the ITP Certificate Program, she created an interactive infographic illustrating how the languages spoken in NYC are represented along the subway lines (subwaylanguages.michelleajohnson.com). She will continue to work on the relationship between language and space at Columbia University in the Center for Spatial Research in the Fall.</p>","image":""},"mck":{"shortname":"mck","name":"Mary Catherine Kinniburgh","title":"Digital Fellow, English","email":"mckinniburgh@gmail.com","website":"","twitter":"@mckinniburgh","github":"","bio":"<p>Mary Catherine is a PhD student in English at The Graduate Center, where she studies textual criticism, twentieth-century poetics, and digital humanities. She has worked with the University of Virginia Press’ Electronic Imprint, ROTUNDA, Columbia University Libraries&#39; Digital Social Sciences Center Data Service, and currently serves as a GC Digital Fellow. In this capacity, she coordinates events for GC Digital Initiatives, promotes digital skill-building through her role as budget manager of the CUNY Strategic Investment Initiative Grant, and is currently piloting a maker space at the GC Digital Scholarship Lab.</p>","image":""},"ip":{"shortname":"ip","name":"Ian Phillips","title":"Digital Fellow, Linguistics","email":"iphillips@gradcenter.cuny.edu","website":"","twitter":"@it_phillips","github":"","bio":"<p>Ian Phillips is a doctoral candidate in the Linguistics Program at CUNY Graduate Center. His research interests span second language acquisition, multilingualism, sentence processing, learnability theory, and new roles for technology in education. His current research uses the event-related potential technique (ERP) to investigate the Spanish of second immigrant generation Spanish-English bilinguals (aka Spanish heritage speakers) in New York City. For the Interactive Technology and Pedagogy (ITP) certificate program, Ian is developing an original web-based application to aid beginning linguistics students in learning linguistic principles and practices. The app is called The Linguist’s Kitchen and provides the space, tools, and recipes for students to “cook” and analyze language data collected from their own communities. Ian also teaches various courses in language and society at City College as well as language learning and teaching at Hunter College and works in the Second Language Acquisition Lab at the GC.</p>","image":""},"psw":{"shortname":"psw","name":"Patrick Sweeney","title":"Digital Fellow, Psychology","email":"psweeney@gradcenter.cuny.edu","website":"","twitter":"@pswee","github":"","bio":"<p>Patrick Sweeney is a doctoral candidate in Psychology at the Graduate Center, City University of New York (CUNY); and a Digital Fellow at the Graduate Center Digital Scholarship Lab. As a part of his role as a Digital Fellow, he is a faculty liaison to the New Media Lab. He also is a graduate student representative to the Executive Committee of the Society for Qualitative Inquiry in Psychology. His dissertation explores the complementary application of computer assisted text analysis and discourse analysis to study how scientific theories about the etiology of homosexuality have become part of public discourse and used in arguments to expand or contract the scope of justice. His research interests include moral inclusion, citizenship, queer theory, qualitative methods, digital media, and critical psychology. Prior to becoming a Digital Fellow, Patrick taught psychology at Hunter College, CUNY; and was a Writing Across the Curriculum Fellow at Kingsborough Community College, CUNY.</p>","image":""},"jt":{"shortname":"jt","name":"Jennifer Tang","title":"Digital Fellow, Environmental Psychology","email":"jtang@gradcenter.cuny.edu","website":"","twitter":"@YouthGovern","github":"","bio":"<p>Jennifer Tang is a doctoral candidate in Environmental Psychology at the Graduate Center. Her research examines children and young people’s political practices in New York City governance. Her research interests includes: children’s rights, children’s participation, community governance, participatory democracy, young people’s political engagement, young people and social movements, young people in urban settings, child-friendly research methods, participatory research, participatory action research, digital tools and technologies for democratic participation (open data, ICT4D, ICT4G).</p>","image":""},"lr":{"shortname":"lr","name":"Lisa Rhody","title":"Deputy Director of Digital Initiatives","email":"lisarhody.gc@gmail.com","website":"","twitter":"@lmrhody","github":"","bio":"<p>Dr. Lisa Rhody is the Deputy Director of Digital Initiatives at the Graduate Center at CUNY. Before joining the Graduate Center, Lisa was associate director of research and research assistant professor at the Roy Rosenzweig Center for History and New Media (RRCHNM) at George Mason University, where she oversaw technical development of PressForward and Zotero. She was also editor of the Journal of Digital Humanities and Digital Humanities Now. She earned her Ph.D. in English Language and Literature from the University of Maryland. Her research combines advanced computational methods such as topic modeling and social network analysis with more traditional literary analysis to study 20th and 21st-century American literature, particularly ekphrastic poetry (poems that take the visual arts as their subject) by contemporary women poets. More broadly, she is interested in the 20th and 21st century American literature, verbal-visual studies, scholarly communication, and digital humanities.</p>","image":""},"sr":{"shortname":"sr","name":"Steven Romalewski","title":"Director, CUNY Mapping Service","email":"sromalewski@gc.cuny.edu","website":"","twitter":"@SR_spatial","github":"","bio":"<p>Steven Romalewski directs the CUNY Mapping Service at the Center for Urban Research at CUNY’s Graduate Center.  The Mapping Service engages with foundations, agencies, businesses, nonprofits, and CUNY researchers to use spatial analysis techniques in applied research projects.  The service specializes in online applications providing intuitive access to powerful data sets, displayed visually through interactive maps and other formats. Examples are listed here: http://www.gc.cuny.edu/urbanresearchmaps  Romalewski was awarded a Revson Fellowship at Columbia University and received an advanced urban planning degree from Columbia. </p>","image":""},"sk":{"shortname":"sk","name":"Stephen Klein","title":"Digital Services Librarian","email":"","website":"","twitter":"@gnosis_imagine","github":"","bio":"<p>Stephen I. Klein, the Digital Services Librarian at the Mina Rees CUNY Graduate School Library, spends much of his work-life behind the scenes insuring that the pulse of library systems continue to work seamlessly for library users, but also spends time &#39;freaking-out&#39; about the invisible crisis of how our cultural heritage is quickly disappearing, because of the acceleration of modern ephemera with the advent of the web as one of the central forums of popular conversation and academic scholarship in the last two decades. In this workshop, Stephen intends to share how, preservation for the digital is light-years behind preserving print and some small incremental techniques that can be embraced insuring that traces of your projects continue to potentially linger on.</p>","image":""},"rs":{"shortname":"rs","name":"Roxanne Shirazi","title":"Dissertation Research Librarian","email":"","website":"","twitter":"@RoxanneShirazi","github":"","bio":"<p></p><p>Roxanne Shirazi is a librarian at the CUNY Graduate Center working with graduate student research methods and electronic theses and dissertations (ETDs). Her other research interests focus on digital scholarship, film studies, documentary photography, labor history, material culture and digital humanities.</p><p>She earned her MSLIS from Pratt Institute, with an Advanced Certificate in Archives. Her concentration was in special collections, with coursework comprising technical services, conservation, reference and outreach for library and archival materials in print, audiovisual, photographic and digital formats.</p><p></p>","image":""},"mw":{"shortname":"mw","name":"Megan Wacha","title":"Scholarly Communications Librarian","email":"","website":"","twitter":"@megwacha","github":"","bio":"<p>Megan Wacha is the Scholarly Communications Librarian in the Office of Library Services at CUNY Central, where she leads each of the campus libraries in the development and management of CUNY’s open access repository, CUNY Academic Works. Prior to joining CUNY, she held positions at the New York Public Library, New York University, and, most recently, at Barnard College. She is also an active Wikipedian, and, guided by the principle that Wikipedia is the encyclopedia anyone can edit, she works to increase contributions by and about women and people from other marginalized groups.</p>","image":""},"sz":{"shortname":"sz","name":"Stephen Zweibel","title":"Digital Scholarship Librarian","email":"","website":"","twitter":"@SteveZweibel","github":"","bio":"<p>Stephen Zweibel is the Data and Digital Projects Librarian at CUNY Graduate Center and the lead developer of the NEH-funded DH Box, a digital humanities laboratory in the cloud. As a library systems specialist, Stephen focuses on emerging technologies for reference and data management, with a particular focus on APIs, web apps, and flexible distributions. His previous projects include Augur, a web app that tracks statistics about library reference desk interactions, and Know Thy Shelf, a radio frequency identification (RFID)-based inventory management system for libraries.</p>","image":""},"jf":{"shortname":"jf","name":"Jenny Furlong","title":"Director, Career Planning and Professional Development","email":"","website":"","twitter":"@CareerPlanGC","github":"","bio":"<p>Jenny Furlong joined the Graduate Center as the Director of Career Planning and Professional Development in February 2013. Dr. Furlong worked most recently at New York University, and previously served as Associate Director of Graduate Student Career Development at Columbia University’s Center for Career Education, and as Associate Director for Graduate Students and Postdoctoral Fellows in the Career Services office of the University of Pennsylvania. She is the co-author of the Career Talk column inThe Chronicle of Higher Education andThe Academic Job Search Handbook, 4th ed. (Philadelphia: U. of Pennsylvania Press, 2009), both of which were written with Julie Vick. Dr. Furlong earned her Ph.D. in Romance Languages at the University of Pennsylvania and her B.A. in Comparative Literary Studies at Northwestern University.</p>","image":""},"jr":{"shortname":"jr","name":"Jason Rhody","title":"Program Director, Digital Culture, Social Science Research Council","email":"","website":"","twitter":"@jasonrhody","github":"","bio":"<p>Jason Rhody has worked as a greenskeeper, landscaper, puppeteer, physics lab technician, technical writer, tech trainer, and helped create a digital humanities center. He is now the Director for the Digital Culture program at the Social Science Research Council (SSRC), located in Brooklyn, NY. Jason joined SSRC after thirteen years at the National Endowment for the Humanities (NEH), where he spent a decade as Senior Program Officer for the Office of Digital Humanities (ODH). He received his PhD in English from the University of Maryland, College Park and continues to research narrative and genre in literature, new media, and computer games.</p>","image":""},"lw":{"shortname":"lw","name":"Luke Waltzer","title":"Director, Teaching and Learning Center","email":"","website":"","twitter":"@lwaltzer","github":"","bio":"<p>Luke Waltzer is the Director of the Teaching and Learning Center at the CUNY Graduate Center, where he supports GC students in their teaching across the CUNY system and beyond, and works on a variety of pedagogy and digital projects. He previously was the director for the Center for Teaching and Learning at Baruch College. He holds a Ph.D. in History from the CUNY Graduate Center, serves as a Community Advisor to the CUNY Academic Commons and on the editorial collective of the Journal of Interactive Technology and Pedagogy, and has contributed essays to Matthew K. Gold&#39;s Debates in the Digital Humanities and, with Thomas Harbison, to Jack Dougherty and Kristen Nawrotzki&#39;s Writing History in the Digital Age.</p>","image":""}}