[{"title":"Command Line","link":"terminal","tagline":"Complete complex tasks with just a few keystrokes.","icon":"icon-shell","repo":"https://github.com/jojokarlin/intro-command-line","more_info_link":"https://github.com/jojokarlin/intro-command-line","session":"3","description":"Introduction to the UNIX command line. Topics covered will include navigating the filesystem, manipulating the environment, executing useful commands, and using pipes to communicate between programs. This session will teach you how to communicate directly with your computer’s operating system using a text-based interface and is a useful first step in learning many other technical skills. ","sort":"c","day":"Day 1"},{"title":"Git","link":"git","tagline":"Simplify collaboration using version control systems.","icon":"fa-code-fork","repo":"https://github.com/pswee001/Git_DRI_Jan_2018","more_info_link":"https://github.com/pswee001/Git_DRI_Jan_2018","session":"4","description":"Git is a tool for managing changes to a set of files. It allows users to access open source repositories, recover earlier versions of a project, and collaborate with other contributors. This session will be beneficial to anyone working with data, code, or text.","sort":"d","day":"Day 2"},{"title":"Python","link":"python","tagline":"Use Python for everything from data analysis to building websites.","icon":"icon-python","repo":"https://github.com/smythp/intro-python-workshop","more_info_link":"https://github.com/smythp/intro-python-workshop","session":"5","description":"Python is a programming language that can be used for a wide range of tasks, including collecting and analyzing data in a variety of formats, building web applications, and much more. It is likely the most popular language for academic researchers because of its flexibility and adaptability.","sort":"e","day":"Day 2"},{"title":"Databases","link":"databases","tagline":"","icon":"fa-database","repo":"https://github.com/itphillips/GCDRI_databases","more_info_link":"https://github.com/itphillips/GCDRI_databases","session":"9","description":"Databases are invaluable tools for organization and are better than a spreadsheet for working with multiple data sets, asking questions, and adding structure to your data. SQL is a programming language for working with databases. This workshop will introduce you to the basics of SQL, and will include hands-on practice creating databases and tables, importing data, and querying the database.","sort":"i","day":"Day 3"},{"title":"Text Analysis","link":"text","tagline":"Process, analyze, and summarize textual data using NLTK.","icon":"fa-book","repo":"https://github.com/rachelrakov/df_code","more_info_link":"https://github.com/rachelrakov/df_code","session":"6","description":"This session will introduce text analysis and text classification in Python using  The Natural Language Toolkit (NLTK) library and scikit-learn. Through attending this session, you will learn how to use Python to analyze large amounts of text (i.e., literary works, social media corpora, etc.) to find word frequencies, collocations, and learn the basics of text classification with machine learning.  This session is designed for researchers who work with various forms of text-based data.","sort":"","day":""},{"title":"Mapping","link":"map","tagline":"","icon":"fa-map-marker","repo":"https://github.com/javo0101/introGIS","more_info_link":"https://github.com/javo0101/introGIS","session":"10","description":"This session introduces simple yet powerful ways of displaying spatial information through CartoDB and QGIS. This session will be of particular interest both to researchers working with spatial information as well as anyone interested in storytelling with maps. ","sort":"","day":""},{"title":"Quantitative\n Analysis","link":"ml","tagline":"Explore the structure of data using machine learning algorithms.","icon":"fa-bar-chart","repo":"https://github.com/GCDigitalFellows/gcdri_ts_cat_ml","more_info_link":"https://github.com/GCDigitalFellows/gcdri_ts_cat_ml","session":"11","description":"This session will introduce data aggregation and preprocessing,  dimension reduction, and supervised and unsupervised machine learning using the Python numpy and  sklearn machine learning libraries. This session is aimed towards researchers who want to find patterns in their data or use their data to predict a phenomena. ","sort":"","day":""},{"title":"HTML and CSS","link":"html","tagline":"Share your research using web development fundamentals.","icon":"fa-code","repo":"","more_info_link":"https://github.com/hackettka/html-css-workshop","session":"8","description":"Modern web pages are created using HTML to control content, CSS to control appearance, and JavaScript to dictate behavior. This session will be helpful for anyone that wants to build on the web.","sort":"","day":""},{"title":"Twitter API","link":"twit","tagline":"","icon":"fa-twitter","repo":"https://github.com/smythp/twitter-workshop","more_info_link":"https://github.com/smythp/twitter-workshop","session":"23","description":"This session will cover the basics of accessing data via the Twitter API. including specific challenges that arise when working with large, text-based data sets. This session will be beneficial for anyone who wants to collect data from Twitter or other social networks. ","sort":"","day":"Day 5"},{"title":"Digital Ethics","link":"ethics","tagline":"","icon":"fa-hand-peace-o\n","repo":"https://github.com/kchatlosh/digiethicsDRI","more_info_link":"https://github.com/kchatlosh/digiethicsDRI","session":"24","description":"A discussion of digital ethics with an emphasis on social justice, transparency, and accessibility.","sort":"","day":""}]