[{"title":"Install-a-Thon","link":"install","tagline":"","icon":"fa-laptop","repo":"https://github.com/GCDigitalFellows/installdri.github.io","more_info_link":"","session":"1","description":"During the first session of the DRI, the Digital Fellows will help participants install and configure all of the software needed for the rest of the week.","sort":"a","day":"Day 1"},{"title":"Design Briefs","link":"design","tagline":"","icon":"fa-pencil-square-o","repo":"","more_info_link":"","session":"2","description":"Start thinking about your research from a digital perspective and learn about the digital projects that other participants are undertaking.","sort":"b","day":"Day 1"},{"title":"Command Line","link":"terminal","tagline":"Complete complex tasks with just a few keystrokes.","icon":"fa-terminal","repo":"","more_info_link":"","session":"3","description":"Introduction to the UNIX command line. Topics covered will include navigating the filesystem, manipulating the environment, executing useful commands, and using pipes to communicate between programs. This session will teach you how to communicate directly with your computer’s operating system using a text-based interface and is a useful first step in learning many other technical skills. For more information, visit: http://swcarpentry.github.io/shell-novice/","sort":"c","day":"Day 1"},{"title":"Git","link":"git","tagline":"Simplify collaboration using version control systems.","icon":"fa-code-fork","repo":"","more_info_link":"","session":"4","description":"Git is a tool for managing changes to a set of files. It allows users to access open source repositories, recover earlier versions of a project, and collaborate with other contributors. This session will be beneficial to anyone working with data, code, or text. For more information, visit: http://swcarpentry.github.io/git-novice/","sort":"d","day":"Day 2"},{"title":"Python","link":"python","tagline":"Use Python for everything from data analysis to building websites.","icon":"icon-python","repo":"","more_info_link":"","session":"5","description":"Python is a programming language that can be used for a wide range of tasks, including collecting and analyzing data in a variety of formats, building web applications, and much more. It is likely the most popular language for academic researchers because of its flexibility and adaptability. For more information visit: http://swcarpentry.github.io/python-novice-inflammation/","sort":"e","day":"Day 2"},{"title":"Text Analysis","link":"text","tagline":"Process, analyze, and summarize textual data using NLTK.","icon":"fa-book","repo":"","more_info_link":"","session":"6","description":"This session will introduce text analysis with Python both with built-in functions and the The Natural Language Toolkit (NLTK) library. Through attending this session, you will learn how to use Python to analyze large amounts of text (i.e., literary works, social media corpora, etc.) to find word frequencies, collocations, and other patterns invisible from a non-computational perspective. This session is designed for researchers who work with various forms of text-based data.","sort":"f","day":"Day 3"},{"title":"Time Series & Categorical Data","link":"ts","tagline":"","icon":"fa-line-chart","repo":"","more_info_link":"","session":"7","description":"","sort":"g","day":"Day 3"},{"title":"HTML, CSS, and Javascript","link":"html","tagline":"Share your research using web development fundamentals.","icon":"fa-code","repo":"","more_info_link":"","session":"8","description":"Modern web pages are created using HTML to control content, CSS to control appearance, and JavaScript to dictate behavior. This session will be helpful for anyone that wants to build on the web.","sort":"h","day":"Day 3"},{"title":"Databases","link":"databases","tagline":"","icon":"fa-database","repo":"","more_info_link":"","session":"9","description":"","sort":"i","day":"Day 3"},{"title":"Mapping","link":"map","tagline":"","icon":"fa-map-marker","repo":"","more_info_link":"","session":"10","description":"Special Guest, Steve Romalewski, will lead this session to introduce simple yet powerful ways of displaying spatial information through CartoDB. This session will be of particular interest both to researchers working with spatial information as well as anyone interested in storytelling with maps. ","sort":"j","day":"Day 4"},{"title":"Machine Learning","link":"ml","tagline":"Explore the structure of data using machine learning algorithms.","icon":"fa-puzzle-piece","repo":"","more_info_link":"","session":"11","description":"This session will introduce regression analysis, data preprocessing, model selection, supervised and unsupervised machine learning and dimension reduction using the sklearn machine learning library. This session is aimed towards researchers who want to find patterns in their data or use their data to predict a phenomena. ","sort":"k","day":"Day 4"},{"title":"Web Frameworks","link":"wf","tagline":"","icon":"fa-flask","repo":"","more_info_link":"","session":"12","description":"","sort":"l","day":"Day 4"},{"title":"Project Laboratory","link":"projects","tagline":"","icon":"fa-cogs","repo":"","more_info_link":"","session":"13","description":"Using the information gathered over the previous days of the DRI, participants will work in teams to develop a digital project plan for datasets relevant to their research areas.","sort":"m","day":"Day 4"},{"title":"Professional Development","link":"prodev","tagline":"","icon":"fa-briefcase","repo":"","more_info_link":"","session":"16","description":"","sort":"n","day":"Day 5"},{"title":"Presentations","link":"presentations","tagline":"","icon":"fa-graduation-cap","repo":"","more_info_link":"","session":"18","description":"Participants will present the results of their Project Laboratory proposals!","sort":"o","day":"Day 5"},{"title":"Data Management Plans","link":"dmp","tagline":"","icon":"fa-cloud-upload","repo":"","more_info_link":"","session":"14","description":"Data Management Plans (DMPs) are required as part of nearly all grant applications, especially those with a digital component. Data management is a necessary part of digital scholarship, and allows dissemination and reproduction of your work. Stephen Zweibel, Digital Scholarship Librarian, will discuss data management and the writing of Data Management Plans.","sort":"p","day":"Day 5"},{"title":"CUNY Academic Works","link":"aw","tagline":"","icon":"fa-archive","repo":"","more_info_link":"","session":"15","description":"Digital work is never done, but what happens when you’re ready to move on? This workshop will introduce CUNY Academic Works, our open access digital repository, as a place to archive your digital project and make it findable, shareable, and citable. We’ll go over practical steps that will help “package” your project for use by future researchers and discuss the ways that an institutional repository differs from services like GitHub or figshare. Graduate Center students incorporating digital elements in their dissertations or capstones will learn about the Library’s format requirements and procedures for depositing digital work or supplementary data for the degree. Attendees will learn how to think about –and plan for – the long-term research use of their projects from the outset. Some time will also be devoted to scholarly communication “pain points” in digital projects, such as rights + permissions, evaluation, credit, and citation.","sort":"q","day":"Day 5"},{"title":"Digital Project Preservation","link":"dpp","tagline":"","icon":"fa-lock","repo":"","more_info_link":"","session":"17","description":"In the submitting born-digital components session, Stephen Klein will discuss how preservation could be approached for the different types of born-digital projects, the current limitations of some approaches and some best web development practices to potentially keep in mind when developing your website. No prior knowledge is necessary.","sort":"s","day":"Day 5"},{"title":"Copyright and Creative Commons Licensing","link":"cccl","tagline":"","icon":"fa-creative-commons","repo":"","more_info_link":"","session":"16","description":"Copyright law is complex and sometimes intimidating, but it can also be used as tool advance your research. This workshop will introduce participants to copyright and creative commons licensing within the context of digital projects. We’ll discuss effective means of identifying and providing appropriate attribution to creative commons licensed materials, applying the principle of fair use to copyrighted works, and making an informed decision when licensing your own work. Participants are encouraged to arrive with questions and ready to talk through select case studies.","sort":"r","day":"Day 5"}]